notes/2016/02/29/redis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Redis基础</title>
<!-- 2016-03-01 二 00:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="FangQian" />
<meta  name="keywords" content="Redis" />
</head>
<body>
<div id="content">
<h1 class="title">Redis基础</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 前言</a></li>
<li><a href="#sec-2">2. Redis在Linux Ubantu中安装</a></li>
<li><a href="#sec-3">3. 通过命令行客户端访问Redis</a></li>
<li><a href="#sec-4">4. 基本操作</a></li>
<li><a href="#sec-5">5. 修改Redis的配置</a>
<ul>
<li><a href="#sec-5-1">5.1. 使用Redis的访问帐号</a></li>
<li><a href="#sec-5-2">5.2. 让Redis服务器被远程访问</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
Redis是常用基于内存的Key-Value数据库, 比Memcache更先进，支持多种数据结构，高效，快速。用Redis可以轻松
解决高并发的数据访问问题；作为实时监控信号处理也非常不错。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Redis在Linux Ubantu中安装</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
# 安装Redis服务器端
$ sudo apt-get install redis-server
</pre>
<p>
安装完成后，Redis服务器会自动启动,我们检查Redis服务器程序
</p>
<pre class="example">
# 检查Redis服务器系统进程
$ ps -aux|grep redis
24330  0.2  0.3 244200 28156 pts/13   S+   19:29   0:01 emacs -nw ./notes/2016/02/29/redis.org
26105  0.0  0.0  15964  2304 pts/5    S+   19:38   0:00 grep --color=auto redis

# 通过启动命令检查Redis服务器状态
$ netstat -nlt|grep 6397
tcp        0      0 127.0.0.1:6379          0.0.0.0:*               LISTEN 

# 通过启动命令检查Redis服务器状态
$ sudo /etc/init.d/redis-server status
redis-server is running
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 通过命令行客户端访问Redis</h2>
<div class="outline-text-2" id="text-3">
<p>
安装Redis服务器，会自动地一起安装Redis命令行客户端程序。
</p>

<p>
在本机输入redis-cli命令就可以启动，客户端程序访问Redis服务器。
</p>
<pre class="example">
$ redis-cli   (means:redis-client)
127.0.0.1:6379&gt;

# 命令行的帮助
127.0.0.1:6379&gt; help
redis-cli 2.8.4
Type: "help @&lt;group&gt;" to get a list of commands in &lt;group&gt;
      "help &lt;command&gt;" for help on &lt;command&gt;
      "help &lt;tab&gt;" to get a list of possible help topics
      "quit" to exit
# 查看所有的key列表
127.0.0.1:6379&gt; keys *
</pre>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 基本操作</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
# 增加一条记录key1
6379&gt; set key1 "hello"
OK

# 打印记录
6379&gt; get key1
"hello"

# 增加一条数字记录key2
6379&gt; set key2 1
OK

#让数字自增
6379 &gt; INCR key2
(integer)2

# 增加列表记录key3
6379&gt; LPUSH key3 a 
(integer)1

# 从左边插入列表
6379&gt; LPUSH key3 b
(integer)2

# 从右边插入列表
6379&gt; RPUSH key3 c
(integer)3

# 打印列表记录，按从左到右的顺序
6379&gt; LRANGE key3 0 3
1) "b"
2) "a"
3) "c"

# 增加一条哈希表记录key4
6379&gt; HSET key4 name "John Smith"
(integer)1

# 在哈希表中插入,email的Key和Value的值
6379&gt; HSET key4 email "abc@gmail,com"
(integer)1

# 打印哈希表中,name为key的值
6379&gt; HGET key4 name

# 打印整个哈希表
6379&gt; HGETALL key4

# 增加一条哈希表记录key5,一次插入多个Key和Value的值
6379&gt; HMSET key5 username antirezpassword P1 pp0 age 3
OK

# 打印哈希表中, username和age为key的值
6379&gt; HMGET key5 username age
1) "antirez"
2) "3"

# 打印完整的哈希表记录
&gt; HGETALL key5
1) "username"
2) "antirez"
3) "password"
4) "P1pp0"
5) "age"
6) "3"

# 删除记录
# 查看所有的key列表keys *

# 删除key1,key5
6379&gt; del key1
(integer)1
6379&gt; del key5
(integer)1
</pre>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 修改Redis的配置</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 使用Redis的访问帐号</h3>
<div class="outline-text-3" id="text-5-1">
<p>
默认情况下，访问Redis服务器是不需要密码的，为了增加安全性我们需要设置Redis服务器的访问密码。设置访问密码为
redisredis。
用vi打开Redis服务器的配置文件redis.conf
</p>
<pre class="example">
$ sudo vi /etc/redis.conf

#取消注释requirepass
requirepass redisredis
</pre>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 让Redis服务器被远程访问</h3>
<div class="outline-text-3" id="text-5-2">
<p>
默认情况下，Redis服务器不允许远程访问，只允许本机访问，所以我们需要设置打开远程访问的功能。
用vi打开Redis服务器的配置文件redis.conf
</p>
<pre class="example">
sudo vi /etc/redis/redis.conf

#注释bind
#bind 127.0.0.1
</pre>

<ul class="org-ul">
<li>From 
</li>
</ul>
<p>
<a href="http://blog.fens.me/linux-redis-install/">在Ubantu中安装Redis</a> 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#26085;&#26399;: 2016/02/29</p>
<p class="author">&#20316;&#32773;: FangQian</p>
<p class="date">Created: 2016-03-01 二 00:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
